       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID.    file-name.
AUTHOR. Derrick Strong.
DATE-WRITTEN.November 6th 2020

ENVIRONMENT DIVISION.

CONFIGURATION SECTION.

DATA DIVISION.

FILE SECTION.

WORKING-STORAGE SECTION.

PROCEDURE DIVISION.



STOP RUN.
